Repository: aroberge/friendly
Catalog: friendly/locales/*/LC_MESSAGES/friendly.po
Languages: fr

source: The name `{var_name}` exists in both the global and nonlocal scope. This can be rather confusing and is not recommended. Depending on which variable you wanted to refer to, you needed to add either global {var_name} or nonlocal {var_name} as the first line inside your function.
fr: Le nom `{var_name}` existe à la fois dans la portée globale et non locale. Cela peut être assez déroutant et n’est pas recommandé. Selon la variable à laquelle vous vouliez vous référer, vous deviez ajouter global {var_name} ou nonlocal {var_name} comme la première ligne à l’intérieur de votre fonction.

source: Did you forget to add either `global {var_name}` or `nonlocal {var_name}`?
fr: Avez-vous oublié d’ajouter soit `global {var_name}` ou `nonlocal {var_name}` ?

source: The name `{var_name}` exists in the {scope} scope. Perhaps the statement {scope} {var_name} should have been included as the first line inside your function.
fr: Le nom `{var_name}` existe dans la portée {scope}. Peut-être la déclaration {scope} {var_name} aurait dû être incluse comme première ligne à l’intérieur de votre fonction.

source: Did you forget to add `{scope} {var_name}`?
fr: Avez-vous oublié d’ajouter `{scope} {var_name}` ?

source: The similar name `{name}` was found in the local scope.
fr: Le nom semblable `{name}` a été trouvé dans la portée locale.

source: In this instance, there are more names ({nb_names}) than {length}, the length of the iterable.
fr: Dans ce cas-ci, il y a plus de noms ({nb_names}) que {length}, la longueur de l’itérable.

source: In this instance, there are more names ({nb_names}) than the length of the iterable, {iter_type} of length {length}.
fr: Dans ce cas-ci, il y a plus de noms ({nb_names}) que la longueur de l’itérable, {iter_type} de longueur {length}.

source: In this instance, there are fewer names ({nb_names}) than the length of the iterable.
fr: Dans ce cas-ci, il y a moins de noms ({nb_names}) que la longueur de l’itérable.

source: In this instance, there are fewer names ({nb_names}) than the length of the iterable, {iter_type} of length {length}.
fr: Dans ce cas-ci, il y a moins de noms ({nb_names}) que la longueur de l’itérable, {iter_type} de longueur {length}.

source: You need to convert to a float first.
fr: Vous devez convertir en nombre décimal (`float`) en premier.

source: The string `'{value}'` needs to be first converted using `float()` before the result can be converted into an integer using `int()`.
fr: La chaîne `'{value}'` doit d’abord être convertie à l’aide de `float()` pour être ensuite convertie en entier à l’aide de `int()`.

source: Using the modulo operator, you are dividing by zero.
fr: En utilisant l’opérateur modulo, vous divisez par zéro.

source: You are dividing by zero.
fr: Vous divisez par zéro.

source: You are dividing by the following term {expression} which is equal to zero.
fr: Vous divisez par le terme suivant {expression} qui est égal à zéro.

source: The following mathematical expression includes a division by zero: {expression}
fr: L’expression mathématique suivante inclut une division par zéro : {expression}

source: Using the modulo operator, you are dividing by the following term {expression} which is equal to zero.
fr: En utilisant l’opérateur modulo, vous divisez par le terme suivant {expression} qui est égal à zéro.

source: The second argument of the `divmod()` function is zero.
fr: Le deuxième argument de la fonction `divmod()` est égal à zéro.

source: You are attempting to raise the number 0 to a negative power which is equivalent to dividing by zero.
fr: Vous essayez d'élever le nombre 0 à une puissance négative ce qui équivaut à diviser par zéro.

source: The following mathematical expression includes a division by zero done using the modulo operator: {expression}
fr: L’expression mathématique suivante inclut une division par zéro faite à l’aide de l’opérateur modulo : {expression}

source: The second argument to the `divmod()` function is equal to zero.
fr: Le deuxième argument de la fonction `divmod()` est égal à zéro.

source: Currently, I cannot guess the likely cause of this error. Try to examine closely the line indicated as well as the line immediately above to see if you can identify some misspelled word, or missing symbols, like (, ), [, ], :, etc. Unless your code uses type annotations, which are beyond our scope, if you think that this is something which should be handled by friendly, please report this case to https://github.com/aroberge/friendly/issues
fr: Présentement, je ne peux pas deviner la cause probable de cette erreur. Essayez d’examiner attentivement la ligne indiquée ainsi que celle immédiatement au dessus pour voir si vous pouvez identifier un mot mal orthographié, ou des symboles manquants, comme (,), [,],:, etc. Si votre code n'utilise pas d'annotations de type, et que vous pensez que friendly devrait pouvoir l'analyser correctement, SVP rapporter ce cas au site suivant: https://github.com/aroberge/friendly/issues

source: Python told us that it expected a colon at the position indicated. However, adding a colon or replacing something else by a colon would not fix the problem.
fr: Python s’attendait à voir deux points, `:`, à la position indiquée. Cependant, l’ajout des deux points ou le remplacement d’autre chose par deux points ne réglerait pas le problème.

source: Python gave us the following informative message about the possible cause of the error: {message} However, I do not recognize this information and I have to guess what caused the problem, but I might be wrong.
fr: Python a donné le message d'information suivant sur la cause possible de l'erreur : {message} Cependant, je ne reconnais pas cette information. Je vais tenter ce deviner la cause de l'erreur mais il est possible que me trompe.

source: The correct syntax is: def name ( ... ):
fr: La syntaxe correct est : def nom ( ... ):

source: A function needs a name.
fr: Une fonction a besoin d’un nom.

source: You tried to define a function and did not use the correct syntax.
fr: Vous vouliez définir une fonction, mais vous avez fait des erreurs de syntaxe.

source: Functions and methods need a name.
fr: Les fonctions et les méthodes ont besoin d’un nom.

source: You tried to define a function or method and did not use the correct syntax.
fr: Vous vouliez définir une fonction ou une méthode, mais vous avez fait des erreurs de syntaxe.

source: Did you forget parentheses?
fr: Avez-vous oublié d’ajouter des parenthèses ?

source: Perhaps you forgot to include parentheses. You might have meant to write {line}
fr: Vous avez peut-être oublié d’inclure des parenthèses. Vous avez peut-être voulu écrire {line}

source: A function definition statement must end with a colon.
fr: Une définition de fonction doit se terminer par deux point, `:`.

source: Did you forget to write a colon?
fr: Avez-vous oublié d’ajouter les deux points `:` ?

source: You wrote `{bad}` instead of a colon.
fr: Tu as écrit `{bad}` au lieu de deux points, `:`.

source: Did you write something by mistake after the colon?
fr: Avez-vous écrit quelque chose par erreur après les deux points `:` ?

source: A block of code must come after the colon.
fr: Un bloc de code doit venir après les deux points.

source: Removing `{bad}`, might fix the problem.
fr: Si vous supprimez `{bad}`, cela pourrait possiblement résoudre le problème.

source: You did not write a valid function definition.
fr: Vous n’avez pas écrit de définition de fonction valide.

source: You forgot to name your function.
fr: Vous avez oublié de nommer votre fonction.

source: You cannot use a Python keyword as a function name.
fr: Vous avez tenté d'utiliser le mot clé Python `{kwd}` comme nom de fonction.

source: You tried to use the Python keyword `{kwd}` as a function name.
fr: Vous avez tenté d'utiliser le mot clé Python `{kwd}` comme nom de fonction. Ceci n’est pas permis.

source: There are more syntax errors later in your code.
fr: Il y a au moins une autre erreur de syntaxe plus tard dans votre code.

source: You wrote an invalid function name.
fr: Vous avez écrit un nom de fonction invalide.

source: The name of a function must be a valid Python identifier, that is a name that begins with a letter or an underscore character, `_`, and which contains only letters, digits or the underscore character.
fr: Le nom d’une fonction doit être un identificateur Python valide, c’est-à-dire un nom qui commence par une lettre ou un caractère de soulignement, `_`, et qui ne contient que des lettres, des chiffres ou le caractère de soulignement.

source: You attempted to use a string as a function name.
fr: Vous avez essayé d’utiliser une chaîne de caractères comme nom de fonction.

source: However, there are some other syntax errors in your code.
fr: Cependant, il y a au moins une autre erreur de syntaxe dans votre code.

source: I am guessing that you tried to use the Python keyword `{kwd}` as an argument in the definition of a function where an identifier (variable name) was expected.
fr: Vous avez tenté d'utiliser le mot clé Python `{kwd}` comme argument dans la définition d'une fonction où un identificateur (nom de variable) était attendu.

source: You cannot use dotted names as function arguments.
fr: Vous avez tenté d'utiliser un objet avec un attribut comme argument de fonction.

source: You cannot use dots in function names.
fr: Vous avez tenté d'utiliser un objet avec un attribut comme nom de fonction.

source: `/` indicates that the previous arguments in a function definition are positional arguments.
fr: `/` indique que les arguments précédents dans une définition de fonction sont des arguments positionnels.

source: Function definitions cannot include the symbol `/` in this Python version.
fr: Les définitions de fonction ne peuvent pas inclure le symbole `/` dans cette version de Python.

source: This symbol can only be used with Python versions 3.8.0 or newer. You are using Python version {version}.
fr: Ce symbole ne peut être utilisé qu’avec les versions Python 3.8.0 ou plus récentes. Vous utilisez la version Python {version}.

source: You have unspecified keyword arguments that appear before the symbol `/`.
fr: Vous avez quelques arguments nommés arbitraires qui apparaissent avant le symbole `/`.

source: Keyword arguments must appear after the `/` symbol.
fr: Les arguments nommés doivent apparaître après le symbole `/`.

source: However, `*` indicates that the arguments that follow must be keyword arguments. When they are used together, `/` must appear before `*`.
fr: Toutefois, `*` indique que les arguments qui suivent doivent être des arguments nommés. Lorsqu’ils sont utilisés ensemble, `/` doit apparaître avant `*`.

source: `*` must appear after `/` in a function definition.
fr: `*` doit apparaître après `/` dans une définition de fonction.

source: `*{name}` must appear after `/` in a function definition.
fr: `*{name}` doit apparaître après `/` dans une définition de fonction.

source: You can only use `/` once in a function definition.
fr: Vous ne pouvez utiliser `/` qu’une seule fois dans une définition de fonction.

source: You can only use `*` once in a function definition.
fr: Vous ne pouvez utiliser `*` qu’une seule fois dans une définition de fonction.

source: It must either be used by itself, `..., *, ...`, or in the form `..., *args ...`, but not both.
fr: Ce symbole doit soit être utilisé par lui-même, `..., *, ...`, ou soit sous la forme `..., *args ...`.

source: `*{name}` must appear before any keyword argument.
fr: `*{name}` doit apparaître avant tout argument nommé.

source: Keyword arguments must appear after the `*` operator.
fr: Les arguments nommés doivent apparaître après le symbole `*`.

source: You cannot use numbers as function arguments.
fr: Vous ne pouvez pas utiliser un nombre comme argument de fonction.

source: You used a number as an argument when defining a function. You can only use identifiers (variable names) as function arguments.
fr: Vous avez utilisé un nombre comme argument lors de la définition d’une fonction. Vous ne pouvez utiliser que des identificateurs (noms de variables) comme arguments de fonction.

source: You cannot use strings as function arguments.
fr: Vous ne pouvez pas utiliser les chaînes comme arguments de fonction.

source: You used a string as an argument when defining a function. You can only use identifiers (variable names) as function arguments.
fr: Vous avez utilisé une chaîne comme argument lors de la définition d’une fonction. Vous ne pouvez utiliser que des identificateurs (noms de variables) comme arguments de fonction.

source: You cannot have explicit tuples as function arguments.
fr: Vous ne pouvez pas avoir des tuples explicites comme arguments de fonction.

source: You can only use identifiers (variable names) as function arguments. Assign any tuple to a parameter and unpack it within the body of the function.
fr: Vous ne pouvez utiliser que des identifiants (noms de variables) comme arguments de fonction. Assignez n’importe quel tuple à un paramètre et dépaquetez-le dans le corps de la fonction.

source: You cannot have explicit lists as function arguments.
fr: Vous ne pouvez pas avoir de listes explicites comme arguments de fonction.

source: You can only use identifiers (variable names) as function arguments.
fr: Vous ne pouvez utiliser que des identifiants (noms de variables) comme arguments de fonction.

source: You cannot have any explicit dict or set as function arguments.
fr: Vous ne pouvez pas avoir des `dict` ou des `set` explicite comme arguments de fonction.

source: You cannot have operators as function arguments.
fr: Vous ne pouvez pas avoir d’opérateurs comme arguments de fonction.

source: Did you mean to write a comma?
fr: Avez-vous oublié une virgule ?

source: I suspect you made a typo and wrote `{op}` instead of a comma. The following statement contains no syntax error: {new_statement}
fr: Je soupçonne que vous avez écrit `{op}` au lieu d’une virgule. L’énoncé suivant ne contient aucune erreur de syntaxe : {new_statement}

source: Did you mean to write an equal sign?
fr: Voulez-vous écrire un signe égal ?

source: I suspect you made a typo and wrote `{op}` instead of an equal sign. The following statement contains no syntax error: {new_statement}
fr: Je soupçonne que vous avez écrit `{op}` au lieu d’un signe d'égalité. L’énoncé suivant ne contient aucune erreur de syntaxe : {new_statement}

source: Did you mean to write `{op}`?
fr: Voulez-vous écrire `{op}`?

source: I suspect you made a typo and added `{op}` by mistake. The following statement contains no syntax error: {new_statement}
fr: Je soupçonne que vous avez écrit `{op}` par erreur. L’énoncé suivant ne contient aucune erreur de syntaxe : {new_statement}

source: You cannot use `{op}` as an argument.
fr: Vous ne pouvez pas utiliser `{op}` comme argument.

source: I suspect you made a typo and wrote `{op}` by mistake. If you replace it by a unique variable name, the result will contain no syntax error.
fr: Je soupçonne que vous avez écrit `{op}` par erreur. Si vous le remplacez par un nom de variable unique, le résultat n'aura aucun erreur de syntaxe.

source: Positional arguments must come before keyword arguments.
fr: Les arguments positionnels doivent être avant les arguments nommés.

source: `{arg}` is a positional argument that appears after one or more keyword arguments in your function definition.
fr: `{arg}` est un argument positionnel qui apparaît après un ou plusieurs arguments nommés dans votre définition de fonction.

source: The line identified above is more indented than expected.
fr: La ligne indiquée ci-dessus par --> est plus indentée que prévu.

source: The line identified above was expected to begin a new indented block.
fr: La ligne indiquée ci-dessus par --> devrait normalement commencer un nouveau bloc de code indenté.

source: The line identified above is less indented than expected.
fr: La ligne indiquée ci-dessus par --> est moins indentée que prévu.

source: However, line {number}, which is identified as having a problem, consists of a single string which is also the case for the preceding line. Perhaps you meant to include a continuation character, `\`, at the end of line {preceding}.
fr: Toutefois, la ligne {number}, qui est identifiée comme ayant un problème, se compose d’une seule chaîne, ce qui est également le cas pour la ligne précédente. Peut-être que vous vouliez inclure un caractère de continuation, '\', à la fin de la ligne {preceding}.

source: You cannot assign a value to `{keyword}`.
fr: Vous ne pouvez pas attribuer une valeur à `{keyword}`.

source: `{keyword}` is a constant in Python; you cannot assign it a value.
fr: `{keyword}` est une constante dans python; vous ne pouvez pas lui assigner une valeur.

source: You were trying to assign a value to the Python keyword `{keyword}`. This is not allowed.
fr: Vous essayiez d’assigner une valeur au mot clé Python `{keyword}`. Ceci n’est pas permis.

source: You can only assign objects to identifiers (variable names).
fr: Vous ne pouvez assigner des objets qu’à des identifiants (noms de variables).

source: On the left-hand side of an equal sign, you have a conditional expression instead of the name of a variable. A conditional expression has the following form: variable = object if condition else other_object
fr: Du côté gauche d'un signe d'égalité, vous avez une expression conditionnelle au lieu du nom d'une variable. Une expression conditionnelle doit avoir la forme suivante: variable = objet if condition else autre_objet

source: some value
fr: une certaine valeur

source: You wrote an expression like {fn_call} = {value} where `{fn_call}`, on the left-hand side of the equal sign, is a function call and not the name of a variable.
fr: Vous avez écrit une expression comme {fn_call} = {value} où `{fn_call}`, du côté gauche du signe d'égalité est une fonction et non le nom d’une variable.

source: You wrote the expression {fn_call} = {value} where `{fn_call}`, on the left-hand side of the equal sign, either is or includes a function call and is not simply the name of a variable.
fr: Vous avez écrit une expression comme {fn_call} = {value} où `{fn_call}`, à la gauche du signe d'égalité est soit l'invocation d'une fonction, ou inclus une telle invocation, et n'est pas simplement le nom d'une variable.

source: On the left-hand side of an equal sign, you have a generator expression instead of the name of a variable.
fr: Du côté gauche d'un signe d'égalité, vous avez une expression génératrice au lieu du nom d'une variable.

source: You wrote an expression that has the f-string `{fstring}` on the left-hand side of the equal sign. An f-string should only appear on the right-hand side of an equal sign.
fr: Vous avez écrit une expression qui a la chaine de caractères formatés `{fstring}` du côté gauche du signe d'égalité. Une telle chaîne ne doit apparaître que du côté droit d'un signe d’égalité.

source: You have written an f-string whose content `{...}` includes a backslash; this is not allowed. Perhaps you can replace the part that contains a backslash by some variable. For example, suppose that you have an f-string like: f"{... 'hello\n' ...}" you could write this as hello = 'hello\n' f"{... hello ...}"
fr: Vous avez écrit une chaîne de caractères formatés dont le contenu `{...}` comprend une barre oblique inverse; ce n’est pas permis. Peut-être pouvez-vous remplacer la partie qui contient une barre oblique inverse par une variable. Par exemple, supposons que vous avez une chaîne comme suit : f"{... 'bonjour\n'...}" vous pourriez écrire ceci comme bonjour = 'bonjour\n' f"{... bonjour ...}"

source: of type `int`
fr: de type `int`

source: of type `complex`
fr: de type `complex`

source: of type `float`
fr: de type `float`

source: of type `str`
fr: de type `str`

source: of type `dict`
fr: de type `dict`

source: of type `list`
fr: de type `list`

source: of type `set`
fr: de type `set`

source: of type `tuple`
fr: de type `tuple`

source: The object named `{name}` is defined with type annotation as a local variable. It cannot be declared to be a global variable.
fr: L’objet nommé `{name}` est défini avec une annotation de type comme une variable locale. Il ne peut pas être déclaré variable globale.

source: A for loop must have the form: for ... in sequence: where `...` must contain only identifiers (variable names) and not literals like `{bad_token}`.
fr: Une boucle for doit avoir la forme: for ... in séquence: où `...` doit contenir seulement des identifiants (noms de variables) et non pas des littéraux comme `{bad_token}`.

source: variable_name
fr: nom_de_variable

source: Perhaps you meant to write: {name} = {literal}
fr: Peut-être que vous vouliez plutôt écrire : {name} = {literal}

source: Perhaps you meant to write `{name} = {literal}`
fr: Peut-être que vous vouliez plutôt écrire : `{name} = {literal}`

source: You wrote an expression like {literal} = {name} where `{literal}`, on the left-hand side of the equal sign, is or includes an actual object {of_type} and is not simply the name of a variable.
fr: Vous avez écrit une expression comme {literal} = {name} où `{literal}`, du côté gauche du signe d'égalité est ou inclut un objet {of_type} et n'est pas simplement le nom d'une variable.

source: You wrote an expression that includes some mathematical operations on the left-hand side of the equal sign which should be only used to assign a value to a variable.
fr: Vous avez écrit une expression qui inclut des opérations mathématiques du côté gauche du signe d'égalité; ceci devrait être utilisé uniquement pour attribuer une valeur à une variable.

source: Perhaps you meant to write `{name}` instead of `{original}`
fr: Peut-être que vous vouliez plutôt écrire `{name}` au lieu de `{original}`.

source: You cannot use the augmented assignment operator `:=`, sometimes called the walrus operator, with literals like `{bad_token}`. You can only assign objects to identifiers (variable names).
fr: Vous ne pouvez pas utiliser l’opérateur d’affectation augmentée `:=`, parfois appelé l’opérateur morse, avec des littéraux comme `{bad_token}`. Vous ne pouvez attribuer des objets qu’à des identifiants (noms de variables).

source: You declared `{name}` as being both a global and nonlocal variable. A variable can be global, or nonlocal, but not both at the same time.
fr: Vous avez utilisé `{name}` comme étant une variable non locale et globale. Une variable peut être d'un seul type à la fois: soit globale, soit non locale, ou soit locale.

source: The Python keyword `break` can only be used inside a `for` loop or inside a `while` loop.
fr: Le mot-clé Python `break` ne peut être utilisé qu'à l'intérieur d'une boucle `for` ou à l'intérieur d'une boucle `while`.

source: The Python keyword `continue` can only be used inside a `for` loop or inside a `while` loop.
fr: Le mot-clé Python `continue` ne peut être utilisé qu'à l'intérieur d'une boucle `for` ou à l'intérieur d'une boucle `while`.

source: You attempted to delete a function call {line} instead of deleting the function's name {correct}
fr: Vous avez tenté de supprimer un appel de fonction {line} au lieu de supprimer le nom de la fonction {correct}

source: You cannot delete the constant `{constant}`.
fr: Vous ne pouvez pas supprimer la constante `{constant}`.

source: You cannot delete the literal `{literal}`. You can only delete the names of objects, or individual items in a container.
fr: Vous ne pouvez pas supprimer le littéral `{literal}`. Vous ne pouvez supprimer que les noms d’objets, ou des items individuels dans un conteneur.
