Repository: aroberge/friendly
Catalog: friendly/locales/*/LC_MESSAGES/friendly.po
Languages: fr

source: The file {filename} does not exist.
fr: Le fichier {filename} n'existe pas.

source: Nothing to show: no exception recorded.
fr: Rien à montrer: pas d’exception enregistrée.

source: Warning: you added a type hint to the python builtin `{name}`.
fr: Attention : vous avez utilisé des annotations de type pour l'identifiant Python (builtin) `{name}`.

source: Warning: you used a type hint for a variable without assigning it a value.
fr: Attention : vous avez utilisé une annotation de type pour une variable sans lui attribuer une valeur.

source: Instead of `{hint}`, perhaps you meant `{assignment}`.
fr: Au lieu de `{hint}`, peut-être que vous vouliez plutôt écrire : `{assignment}`.

source: Warning: you have redefined the python builtin `{name}`.
fr: Attention : vous avez redéfini l'identifiant Python (builtin) `{name}`.

source: Nothing to go back to: no exception recorded.
fr: Impossible de revenir en arrière: il n'y a pas d’exception enregistrée.

source: The first argument of `www()` must be either `None` or a string.
fr: Le premier argument de `www()` doit être soit `None` ou une chaîne de caractères.

source: If you wish to open Python's documentation, use `www(python=True)`.
fr: Si vous désirez ouvrir la documentation Python, utilisez `www(python=True)`.

source: https://docs.python.org/3/
fr: https://docs.python.org/fr/3/

source: https://docs.python.org/3/search.html?q=
fr: https://docs.python.org/fr/3/search.html?q=

source: The default web browser cannot be used for searching.
fr: Le navigateur Web par défaut ne peut pas être utilisé pour la recherche.

source: Python exception:
fr: Exception Python:

source: Warning: improperly formed exception. I suspect that a custom exception has been raised with a non-string value used as a message. This can occur if a `__repr__` or a `__str__` method raises an exception or does not return a string.
fr: Avertissement : exception mal formée. Je soupçonne qu’une exception a été soulevée avec une valeur différente d'une chaîne de caractères utilisée comme message. Cela peut se produire si une méthode `__repr__` ou `__str__` soulève une exception ou ne retourne pas une chaîne.

source: {filename} is not a regular Python file whose contents can be analyzed.
fr: {filename} n’est pas un fichier Python dont le contenu peut être analysé.

source: Exception raised on line {linenumber} of file {filename}.
fr: Exception levée à la ligne {linenumber} du fichier {filename}.

source: Execution stopped on line {linenumber} of file {filename}.
fr: L'exécution s'est arrêtée à la ligne {linenumber} du fichier {filename}

source: `{filename}` is not a regular Python file whose contents can be analyzed.
fr: `{filename}` n’est pas un fichier Python dont le contenu peut être analysé.

source: Python could not understand the code in the file '{filename}' beyond the location indicated by ^.
fr: Python peut seulement comprendre le code du fichier '{filename}' jusqu'à l'endroit indiqué par ^.

source: Python could not understand the code the file '{filename}'. It reached the end of the file and expected more content.
fr: Python ne peut pas comprendre le code du fichier '{filename}'. La fin du fichier a été atteinte et Python s'attendait à voir plus de code.

source: Python could not understand the code in the file '{filename}' for an unspecified reason.
fr: Python ne peut pas comprendre le code du fichier '{filename}' pour une raison non spécifiée.

source: More lines not shown.
fr: Plus de lignes non affichées.

source: Problem: source of `{filename}` is not available
fr: Problème : la source de `{filename}` n'est pas disponible.

source: Unfortunately, no additional information is available: the content of file '<stdin>' is not accessible. Are you using a regular Python console instead of a Friendly-console?
fr: Malheureusement, aucune information supplémentaire n’est disponible: le contenu du fichier '<stdin>' n’est pas accessible. Est-ce que vous utilisez une console Python plutôt que la console "Friendly" ?

source: I do not know.
fr: Je ne sais pas.

source: I have no suggestion to offer; try `why()`.
fr: Je n’ai aucune suggestion à offrir; essayez `why()`.

source: I have no suggestion to offer.
fr: Je n’ai aucune suggestion à offrir.

source: `ArithmeticError` is the base class for those built-in exceptions that are raised for various arithmetic errors. It is unusual that you are seeing this exception; normally, a more specific exception should have been raised.
fr: `ArithmeticError` est la classe de base pour les exceptions qui sont soulevées pour diverses erreurs arithmétiques. Il est inhabituel que vous voyiez cette exception; normalement, une exception plus spécifique aurait dû être soulevée.

source: In Python, the keyword `assert` is used in statements of the form `assert condition`, to confirm that `condition` is not `False`. If `condition` is `False`, an `AssertionError` is raised.
fr: Dans Python, le mot clé `assert` est utilisé dans des énoncés ayant la forme `assert condition`, pour confirmer que `condition` n’est pas équivalent à `False`. Si `condition` est `False`, une exception de type `AssertionError` est levée.

source: An `AttributeError` occurs when the code contains something like `object.x` and `x` is not a method or attribute (variable) belonging to `object`.
fr: Une exception `AttributeError` se produit lorsque le code contient quelque chose comme `object.x` et `x` n’est pas une méthode ou un attribut (variable) appartenant à `objet`.

source: An `EOFError` is raised when the `input()` function hits an end-of-file condition (EOF) without reading any data.
fr: Une exception de type `EOFError` a lieu lorsque la fonction `input()` atteint une condition de fin de fichier (EOF) sans lire aucune données.

source: A `FileNotFoundError` exception indicates that you are trying to open a file that cannot be found by Python. This could be because you misspelled the name of the file.
fr: Une exception `FileNotFoundError` indique que vous essayez d’importer un module qui ne peut pas être trouvé par Python. Cela pourrait être parce que vous fait une faute d'orthographe en écrivant le nom du fichier.

source: An `ImportError` exception indicates that a certain object could not be imported from a module or package. Most often, this is because the name of the object is not spelled correctly.
fr: L'exception `ImportError` indique qu’un certain objet n’a pas pu être importé à partir d’un module ou d’un paquet. Très souvent, c’est parce que le nom de l’objet n’est pas écrit correctement.

source: An `IndentationError` occurs when a given line of code is not indented (aligned vertically with other lines) as expected.
fr: Une exception de type `IndentationError` se produit lorsqu'une ligne de code n'est pas indentée (c'est-à-dire alignée verticalement avec les autres lignes) de la façon attendue.

source: An `IndexError` occurs when you try to get an item from a list, a tuple, or a similar object (sequence), and use an index which does not exist; typically, this happens because the index you give is greater than the length of the sequence.
fr: Une exception `IndexError` se produit lorsque vous essayez d’obtenir un élément d'une liste, d'un tuple, ou d'un objet similaire (séquence), à l’aide d’un index qui n’existe pas; typiquement, c’est parce que l’index que vous donnez est plus grand que la longueur de la séquence.

source: A `KeyError` is raised when a value is not found as a key in a Python dict.
fr: Une exception `KeyError` est levée lorsqu’une valeur n’est pas trouvée en tant que clé dans un dictionnaire (dict) Python.

source: `LookupError` is the base class for the exceptions that are raised when a key or index used on a mapping or sequence is invalid. It can also be raised directly by codecs.lookup().
fr: `LookupError` est la classe de base pour les exceptions qui sont levées lorsqu’une clé ou un index utilisé sur un tableau de correspondance ou une séquence est invalide. Elle peut également être levée directement par codecs.lookup().

source: A `ModuleNotFoundError` exception indicates that you are trying to import a module that cannot be found by Python. This could be because you misspelled the name of the module or because it is not installed on your computer.
fr: Une exception `ModuleNotFoundError` indique que vous essayez d’importer un module qui ne peut pas être trouvé par Python. Cela pourrait être parce que vous fait une faute d'orthographe en écrivant le nom du module, ou parce qu’il n’est pas installé sur votre ordinateur.

source: A `NameError` exception indicates that a variable or function name is not known to Python. Most often, this is because there is a spelling mistake. However, sometimes it is because the name is used before being defined or given a value.
fr: Une exception `NameError` indique que le nom d'une variable ou d'une fonction n'est pas connue par Python. Habituellement, ceci indique une simple faute d'orthographe. Cependant, cela peut également indiquer que le nom a été utilisé avant qu'on ne lui ait associé une valeur.

source: An `OverflowError` is raised when the result of an arithmetic operation is too large to be handled by the computer's processor.
fr: Une exception de type `OverflowError` est levée lorsque le résultat d’une opération arithmétique est trop grand pour être manipulé par le processeur de l’ordinateur.

source: A `RecursionError` is raised when a function calls itself, directly or indirectly, too many times. It almost always indicates that you made an error in your code and that your program would never stop.
fr: Une exception de type `RecursionError` est levée lorsqu’une fonction s'invoque elle-même, directement ou indirectement, trop de fois. Cette exception indique presque toujours que vous avez fait une erreur dans votre code et que votre programme ne terminerait jamais.

source: `StopIteration` is raised to indicate that an iterator has no more item to provide when its `__next__` method is called by the `next()` builtin function.
fr: Une exception de type `StopIteration` est levée pour indiquer qu’un itérateur n’a plus d'élément à fournir lorsque sa méthode `__next__` est invoquée par la fonction builtin `next()`.

source: A `SyntaxError` occurs when Python cannot understand your code.
fr: Une exception de type `SyntaxError` se produit lorsque Python ne peut pas comprendre votre code.

source: A `TabError` indicates that you have used both spaces and tab characters to indent your code. This is not allowed in Python. Indenting your code means to have block of codes aligned vertically by inserting either spaces or tab characters at the beginning of lines. Python's recommendation is to always use spaces to indent your code.
fr: Une exception de type `TabError` indique que vous avez utilisé des espaces ainsi que des caractères de tabulation pour indenter votre code. Cela n’est pas autorisé dans Python. L’indentation de votre code signifie que le bloc de codes est aligné verticalement en insérant des espaces ou des tabulations au début des lignes. La recommandation de Python est de toujours utiliser des espaces pour indenter votre code.

source: A `TypeError` is usually caused by trying to combine two incompatible types of objects, by calling a function with the wrong type of object, or by trying to do an operation not allowed on a given type of object.
fr: Une exception `TypeError` est généralement causée une tentative de combiner deux types d’objets incompatibles, en invoquant une fonction avec le mauvais type d’objet, ou en tentant d'effectuer une opération non permise sur un type d'objet donné.

source: A `ValueError` indicates that a function or an operation received an argument of the right type, but an inappropriate value.
fr: Une exception `ValueError` indique qu'une fonction ou une opération a reçu un argument du bon type, mais une valeur inappropriée.

source: In Python, variables that are used inside a function are known as local variables. Before they are used, they must be assigned a value. A variable that is used before it is assigned a value is assumed to be defined outside that function; it is known as a `global` (or sometimes `nonlocal`) variable. You cannot assign a value to such a global variable inside a function without first indicating to Python that this is a global variable, otherwise you will see an `UnboundLocalError`.
fr: En Python, les variables utilisées à l’intérieur d’une fonction sont appelées variables «locales». Avant d’utiliser une variable locale, une valeur doit lui être attribuée. Une variable utilisée avant l’attribution d’une valeur est supposée être définie en dehors de cette fonction; elle est connu comme une variable «globale» (`global` ou parfois `nonlocal`). Vous ne pouvez pas assigner une valeur à une telle variable globale à l’intérieur d’une fonction sans d’abord confirmer à python qu’il s’agit d’une variable globale, sinon vous verrez une exception `UnboundLocalError`.

source: No information is available about this warning.
fr: Aucune information n’est disponible sur cet avertissement.

source: A `ZeroDivisionError` occurs when you are attempting to divide a value by zero either directly or by using some other mathematical operation.
fr: Une exception de type `ZeroDivisionError` se produit lorsque vous essayez de diviser une valeur par zéro soit directement ou en utilisant une autre opération mathématique.

source: In your program, the name of the file that cannot be found is `{filename}`.
fr: Dans votre programme, le nom du fichier inconnu est `{filename}`.

source: a complex number
fr: un nombre complexe (`complex`)

source: a dictionary (`dict`)
fr: un dictionnaire (`dict`)

source: a number (`float`)
fr: un nombre (`float`)

source: a `frozenset`
fr: un ensemble de type `frozenset`

source: an integer (`int`)
fr: un entier (`int`)

source: a `list`
fr: une liste (`list`)

source: a variable equal to `None` (`NoneType`)
fr: une variable ayant la valeur `None` ('NoneType')

source: a `set`
fr: un ensemble (`set`)

source: a string (`str`)
fr: une chaîne de caractères (`str`)

source: a `tuple`
fr: un `tuple`

source: A type hint found for `{name}` in the {scope} scope. Perhaps you had used a colon instead of an equal sign and wrote {name} : {hint} instead of {name} = {hint}
fr: Une annotation de type a été trouvée pour `{name}` dans la portée '{scope}' Peut-être que vous aviez utilisé deux points au lieu d’un signe égal et écrit {name} : {hint} au lieu de {name} = {hint}

source: Friendly themes are only available in Mu's REPL.
fr: Les thèmes pour friendly ne peuvent être utilisés que dans le REPL de Mu.

source: No information is known about this exception. Please report this example to https://github.com/aroberge/friendly/issues If you are using the Friendly console, use `www()` to do an Internet search for this particular case.
fr: Aucune information n’est connue à propos de cette exception. Veuillez signaler cet exemple à https://github.com/aroberge/friendly/issues Si vous utilisez la console Friendly, utilisez `www()` pour faire une recherche sur Internet pour ce cas particulier.

source: Internal error for Friendly-traceback. Please report this example to https://github.com/aroberge/friendly/issues
fr: Exception soulevée par Friendly-traceback. Veuillez signaler cet exemple à https://github.com/aroberge/friendly/issues

source: If you are using a Friendly console, you might want to use the function `www()` which will open a browser at a relevant place in the Python documentation.
fr: Si vous utilisez une console Friendly, vous pouvez utiliser la fonction `www()` qui ouvrira un navigateur à une place pertinente dans la documentation Python.

source: You are attempting to access the attribute `{attr}` for a variable whose value is `None`.
fr: Vous tentez d’accéder à l’attribut `{attr}` pour une variable dont la valeur est `None`.

source: Did you give your program the same name as a Python module?
fr: Avez-vous donné à votre programme le même nom qu’un module Python ?

source: I suspect that you used the name `{module}.py` for your program and that you also wanted to import a module with the same name from Python's standard library. If so, you should use a different name for your program.
fr: Je soupçonne que vous avez utilisé le nom `{module}.py` pour votre programme et que vous vouliez aussi importer un module du même nom de la bibliothèque standard de Python. Si c’est le cas, vous devriez utiliser un nom différent pour votre programme.

source: You have a circular import.
fr: Vous avez une importation circulaire.

source: You likely have a circular import.
fr: Vous avez probablement une importation circulaire.

source: Python indicated that the module `{module}` was not fully imported. This can occur if, during the execution of the code in module `{module}`. some other module is imported where an attempt to import and execute the code in `{module}` is made again!
fr: Python a indiqué que le module `{module}` n’était pas entièrement importé. Cela peut se produire si, lors de l’exécution du code dans le module `{module}`. un autre module est importé et une seconde tentative d’importer et d'exécuter le code dans `{module}` est faite.

source: This should not happen: Python tells us that module `{module}` does not have an attribute named `{attribute}`. However, it does not appear that module `{module}` was imported.
fr: Cela ne devrait pas se produire : Python nous dit que le module `{module}` n’a pas d’attribut nommé `{attribute}`. Toutefois, il ne semble pas que le module `{module}` ait été importé.

source: Did you mean `{name}`?
fr: Vouliez-vous dire `{name}` ?

source: Perhaps you meant to write `{module}.{correct}` instead of `{module}.{typo}`
fr: Peut-être que vous vouliez plutôt écrire : `{module}.{correct}` au lieu de `{module}.{typo}`.

source: Instead of writing `{module}.{typo}`, perhaps you meant to write one of the following names which are attributes of module `{module}`: `{names}`
fr: Au lieu d’écrire `{module}.{typo}`, peut-être que vous vouliez écrire l'un des attributs suivants du module `{module}` : {names}

source: You imported a module named `{module}` from `{mod_path}`. There is also a module named `{module}` in Python's standard library. Perhaps you need to rename your module.
fr: Vous avez importé un module nommé `{module}` de `{mod_path}`. Il y a aussi un module nommé `{module}` dans la bibliothèque standard de Python. Peut-être avez-vous besoin de renommer votre module.

source: Perhaps you meant to use the attribute `{attribute}` of module `{mod_name}` instead of module `{module}`.
fr: Peut-être vouliez-vous utiliser l’attribut `{attribute}` du module `{mod_name}` au lieu du module `{module}`.

source: Did you mean one of the following modules: `{names}`?
fr: Vouliez-vous dire l’un des modules suivants: `{names}` ?

source: Instead of the module `{module}`, perhaps you wanted to use the attribute `{attribute}` of one of the following modules: `{names}`.
fr: Au lieu du module `{module}`, peut-être vouliez-vous utiliser l’attribut `{attribute}` de l'un des modules suivants: `{names}` .

source: Python tells us that no object with name `{attribute}` is found in module `{module}`.
fr: Python nous dit qu’aucun objet avec le nom `{attribute}` n’est dans le module `{module}`.

source: `{obj_name}` is a function. Perhaps you meant to write `{obj_name}({attribute})`
fr: `{obj_name}` est une fonction. Peut-être que vous vouliez écrire `{obj_name}({attribute})`

source: Did you mean `{obj_name}({attribute})`?
fr: Vouliez-vous dire `{obj_name}({attribute})` ?

source: `{obj_name}` is a Python built-in function or method which does not have an attribute named `{attribute}.`
fr: `{obj_name}` est une fonction ou une méthode Python de type 'builtin' qui n’a pas d’attribut nommé `{attribute}`.

source: The object `{obj}` has no attribute named `{attr}`.
fr: L’objet `{obj}` n’a pas d’attribut nommé `{attr}`.

source: Note that object `{obj}` uses `__slots__` which prevents the creation of new attributes.
fr: Notez que l’objet `{obj}` utilise `__slots__` qui empêche la création de nouveaux attributs.

source: The following are some of its known attributes: `{names}`.
fr: Voici quelques-uns de ses attributs connus : `{names}`.

source: Perhaps you meant to write `{obj}.{correct}` instead of `{obj}.{typo}`
fr: Peut-être que vous vouliez plutôt écrire : `{obj}.{correct}` au lieu de `{obj}.{typo}`.

source: Did you mean one of the following: `{names}`?
fr: Vouliez-vous dire l’un des éléments suivants: `{names}` ?

source: Instead of writing `{obj}.{typo}`, perhaps you meant to write one of the following names which are attributes of object `{obj}`: `{names}`
fr: Au lieu d’écrire `{obj}.{typo}`, peut-être que vous vouliez écrire l'un des attributs suivants de l'objet `{obj}` : {names}

source: Did you write a comma by mistake?
fr: Avez-vous écrit une virgule par erreur ?

source: `{obj_name}` is a tuple that contains a single item which does have `'{attribute}'` as an attribute. Perhaps you added a trailing comma by mistake at the end of the line where you defined `{obj_name}`.
fr: `{obj_name}` est un tuple qui contient un seul élément ayant `{attribute}` comme attribut. Peut-être avez-vous ajouté une virgule par erreur à la fin de la ligne lorsque vous avez défini `{obj_name}`.

source: Did you mean `'...'.join({obj_name})`?
fr: Vouliez-vous utiliser `'...'.join({obj_name})` ?

source: The object `{obj_name}` has no attribute named `join`. Perhaps you wanted something like `'...'.join({obj_name})`.
fr: L’objet `{obj_name}` n’a pas d’attribut nommé `join`. Vous vouliez peut-être plutôt écrire quelque chose comme `'...'.join({obj_name})`.

source: Did you mean `{known_builtin}({obj_name})`?
fr: Vouliez-vous utiliser `{known_builtin}({obj_name})` ?

source: The object `{obj_name}` has no attribute named `{attribute}`. Perhaps you can use the Python builtin function `{known_builtin}` instead: `{known_builtin}({obj_name})`.
fr: L’objet `{obj_name}` n’a pas d’attribut nommé `{attribute}`. Peut-être pouvez-vous utiliser la fonction Python builtin `{known_builtin}` à la place: `{known_builtin}({obj_name})`.

source: Did you mean `{attr}`?
fr: Vouliez-vous dire `{attr}` ?

source: The object `{name}` has no attribute named `{attribute}`.
fr: L’objet `{name}` n’a pas d’attribut nommé `{attribute}`.

source: However, `{attr}` is an attribute of `{name}` with a similar meaning.
fr: Cependant, `{attr}` est un attribut de `{name}` avec une sens similaire.

source: However, `{name}` has the following attributes with similar meanings: `{attributes}`.
fr: Toutefois, `{name}` a les attributs suivants avec des sens similaires: '{attributes}'.

source: Did you mean to separate object names by a comma?
fr: Vouliez-vous séparer les noms d’objets par une virgule ?

source: `{second}` is not an attribute of `{first}`. However, both `{first}` and `{second}` are known objects. Perhaps you wrote a period to separate these two objects, instead of using a comma.
fr: `{second}` n’est pas un attribut de `{first}`. Cependant, les objets `{first}` et `{second}` sont des objets connus. Peut-être avez-vous écrit une période pour séparer ces deux objets, au lieu d’utiliser une virgule.

source: The object that could not be imported is `{name}`. The module or package where it was expected to be found is `{module}`.
fr: L’objet qui n’a pas pu être importé est `{name}`. Le module ou le paquet d'où il devait être importé est `{module}`.
