Repository: aroberge/friendly
Catalog: friendly/locales/*/LC_MESSAGES/friendly.po
Languages: fr

source: You have defined a function repeating the keyword argument {name} twice; each keyword argument should appear only once in a function definition.
fr: Vous avez défini une fonction répétant l'argument nommé {name} deux fois; chaque argument nommé ne doit apparaître qu'une seule fois dans une définition de fonction.

source: Did you forget a closing quote?
fr: Avez-vous oublié d’ajouter un guillemet ?

source: You started writing a string with a single or double quote but never ended the string with another quote on that line.
fr: Vous aviez commencé à écrire une chaîne de caractères avec un guillemet simple ou double, mais n'avez jamais terminé la chaîne avec un autre guillemet sur cette ligne.

source: Perhaps you meant to write the backslash character, `\` as the last character in the string and forgot that you needed to escape it by writing two `\` in a row.
fr: Peut-être que vous vouliez écrire une barre oblique inverse, `\` comme le dernier caractère de la chaîne et vous oublié que vous deviez en écrire deux `\` d’affilée.

source: Did you forget to escape a backslash character?
fr: Avez-vous oublié d’échapper un caractère barre oblique inverse ?

source: One of the following two possibilities could be the cause: 1. You meant to do a comparison with == and wrote = instead. 2. You called a function with a named argument: a_function(invalid=...) where `invalid` is not a valid identifier (variable name) in Python either because it starts with a number, or is a string, or contains a period, etc.
fr: L'une des deux possibilités suivantes pourrait être la cause: 1. Vous vouliez faire une comparaison avec `==` et vous avez écrit `=` à sa place. 2. Vous avez invoqué une fonction avec un argument nommé: une_fonction (invalide=...) où `invalide` n'est pas un identifiant (nom de variable) valide dans Python soit parce qu'il commence par un chiffre, soit qu'il est une chaîne, ou qu'il contient un point, etc.

source: You are using a generator expression, something of the form x for x in thing You must add parentheses enclosing that expression.
fr: Vous utilisez une expression de générateur, quelque chose de la forme x for x in objet Vous devez ajouter des parenthèses qui entourent cette expression.

source: You have called a function repeating the same keyword argument (`{arg}`). Each keyword argument should appear only once in a function call.
fr: Vous avez invoqué une fonction en répétant le même argument nommé (`{arg}`). Chaque argument de ce type ne peut apparaître qu'une seule fois.

source: You likely called a function with a named argument: a_function(invalid=something) where `invalid` is not a valid variable name in Python either because it starts with a number, or is a string, or contains a period, etc.
fr: Vous avez probablement appelé une fonction avec un argument : une_fonction (invalide=quelque_chose) où `invalide` n'est pas un nom de variable valide dans Python soit parce qu'il commence par un chiffre, soit qu'il est une chaîne, ou qu'il contient un point, etc.

source: Did you use copy-paste?
fr: Avez-vous utilisé le copier-coller ?

source: Python indicates that you used the unicode character `{bad_character}` which is not allowed.
fr: Python indique que vous avez utilisé le caractère unicode `{bad_character}` ce qui n’est pas permis.

source: Did you mean to use a normal quote character, `'` or `"`?
fr: Vouliez vous utiliser un guillemet normal, `'` ou `"` ?

source: I suspect that you used a fancy unicode quotation mark instead of a normal single or double quote for a string.
fr: Je soupçonne que vous avez utilisé un guillemet unicode au lieu d'un guillemet normal (simple ou double) pour une chaîne de caractères.

source: Python tells us that the closing `{closing}` on the last line shown does not match the opening `{opening}` on line {lineno}.
fr: Python nous dit que la parenthèse de droite `{closing}` sur la dernière ligne ne correspond pas à la parenthèse de gauche `{opening}` sur la ligne {lineno}.

source: Python tells us that the closing `{closing}` on the last line shown does not match the opening `{opening}`.
fr: Python nous dit que la parenthèse de droite `{closing}` ne correspond pas à la parenthèse de gauche `{opening}`.

source: Perhaps you forgot a closing quote.
fr: Avez-vous oublié d’ajouter un guillemet ?

source: Inside the f-string `{fstring}`, you have another string, which starts with either a single quote (') or double quote ("), without a matching closing one.
fr: À l'intérieur de la chaîne `{fstring}`, qui est une chaîne de caractères préfixée de la lettre f, vous avez une autre chaîne de caractère qui débute soit avec un apostrophe (') ou des guillemets ("), mais n'est pas terminé par un autre caractère semblable.

source: You are including the statement {newline} indicating that `{name}` is a variable defined outside a function. You are also using the same `{name}` as an argument for that function, thus indicating that it should be variable known only inside that function, which is the contrary of what `global` implied.
fr: Vous avec inclus l'énoncé {newline} indiquant que `{name}` est une variable définie en dehors d'une fonction. Vous utilisez également le même `{name}` comme un argument pour cette fonction; un argument de fonction est une variable locale connue seulement à l'intérieur de cette fonction, ce qui est le contraire de ce que `global` sous-entendait.

source: You assigned a value to the variable `{name}` before declaring it as a global variable.
fr: Vous avez attribué une valeur à la variable `{name}` avant de la déclarer comme une variable globale.

source: You used the variable `{name}` before declaring it as a global variable.
fr: Vous avez utilisé la variable `{name}` avant de la déclarer comme une variable globale.

source: Did you forget to add `nonlocal`?
fr: Avez-vous oublié d’ajouter `nonlocal` ?

source: You assigned a value to the variable `{name}` before declaring it as a nonlocal variable.
fr: Vous avez attribué une valeur à la variable `{name}` avant de la déclarer comme variable non locale.

source: You used `{name}` as a parameter for a function before declaring it also as a nonlocal variable: `{name}` cannot be both at the same time.
fr: Vous avez utilisé `{name}` comme paramètre pour une fonction avant de la déclarer également comme une variable non locale : `{name}` ne peut pas être les deux en même temps.

source: Did you forget to write `nonlocal` first?
fr: Avez-vous oublié d’ajouter `nonlocal` en premier ?

source: You used the variable `{name}` before declaring it as a nonlocal variable.
fr: Vous avez utilisé la variable `{name}` avant de la déclarer comme variable non locale.

source: You used the nonlocal keyword at a module level. The nonlocal keyword refers to a variable inside a function given a value outside that function.
fr: Vous avez utilisé le mot clé nonlocal au niveau d'un module. Le mot clé nonlocal fait référence à une variable à l'intérieur d'une fonction qui a une valeur attribuée à l'extérieur de cette fonction.

source: You declared the variable `{name}` as being a nonlocal variable but it cannot be found.
fr: Vous avez déclaré la variable `{name}` comme non locale mais elle n'existe pas ailleurs.

source: You are using the continuation character `\` outside of a string, and it is followed by some other character(s).
fr: Vous utilisez le caractère de continuation `\` en dehors d'une chaîne de caractères, et il est suivi par au moins un autre caractère.

source: I am guessing that you wanted to divide by the number {number} and wrote \ instead of /.
fr: Je suppose que vous vouliez diviser par le nombre {number} et avez écrit \ au lieu de /.

source: Did you mean to divide by {number}?
fr: Voulez-vous diviser par {number} ?

source: I am guessing that you forgot to enclose some content in a string.
fr: Je suppose que vous avez oublié d’enfermer du contenu dans une chaîne de caractères.

source: Python tells us that it reached the end of the file and expected more content.
fr: Python nous dit qu'il a atteint la fin du fichier et s'attendait à plus de contenu.

source: I will attempt to be give a bit more information.
fr: Je vais essayer de donner un peu plus d'informations.

source: The closing {bracket} on line {linenumber} does not match anything.
fr: Le symbole {bracket} à la ligne {linenumber} n'a pas de symbole ouvrant qui lui correspond.

source: In Python, you can call functions with only positional arguments test(1, 2, 3) or only keyword arguments test(a=1, b=2, c=3) or a combination of the two test(1, 2, c=3) but with the keyword arguments appearing after all the positional ones. According to Python, you used positional arguments after keyword ones.
fr: Dans Python, vous pouvez invoquer les fonctions avec seulement des arguments de position test(1, 2, 3) ou seulement des arguments nommés test (a=1, b=2, c=3) ou une combinaison des deux test(1, 2, c=3) mais avec les arguments nommés apparaissant après tous les arguments positionnels. Selon Python, vous avez utilisé des arguments positionnels après des arguments nommés.

source: In Python, you can define functions with only positional arguments def test(a, b, c): ... or only keyword arguments def test(a=1, b=2, c=3): ... or a combination of the two def test(a, b, c=3): ... but with the keyword arguments appearing after all the positional ones. According to Python, you used positional arguments after keyword ones.
fr: Dans Python, vous pouvez définir les fonctions avec seulement des arguments de position def test(a, b, c): ... ou seulement des arguments nommés def test(a=1, b=2, c=3): ... ou une combinaison des deux def test(a, b, c=3): ... mais avec les arguments nommés apparaissant après tous les arguments positionnels. Selon Python, vous avez utilisé des arguments positionnels après des arguments nommés.

source: Perhaps you need to type print({message}) In older version of Python, `print` was a keyword. Now, `print` is a function; you need to use parentheses to call it.
fr: Peut-être que vous avez besoin d'écrire print({message}) Dans l'ancienne version de Python, `print` était un mot clé. Maintenant, `print` est une fonction; vous devez utiliser des parenthèses pour l'invoquer.

source: Did you mean `print({message})`?
fr: Vouliez-vous dire `print({message})` ?

source: The star operator `*` is interpreted to mean that iterable unpacking is to be used to assign a name to each item of an iterable, which does not make sense here.
fr: L’opérateur astérisque `*` est interprété comme signifiant que le déballage itérable doit être utilisé pour attribuer un nom à chaque élément d’un itérable, ce qui n’a pas de sens ici.

source: You can only use a `return` statement inside a function or method.
fr: Vous ne pouvez utiliser un énoncé `return` qu'à l’intérieur d’une fonction ou d’une méthode.

source: Seriously?
fr: Sérieusement ?

source: You cannot be serious! In case this is a mistake in a real program, please consider reducing the number of nested code blocks.
fr: Vous n'êtes pas sérieux ! Dans le cas où il s’agit d’une erreur dans un vrai programme, s’il vous plaît songez à réduire le nombre de blocs de code imbriqués.

source: Did you forget something after `*`?
fr: Avez-vous oublié d’ajouter quelque chose après `*` ?

source: Assuming you were defining a function, you need to replace `*` by either `*arguments` or by `*, named_argument=value`.
fr: En supposant que vous définissiez une fonction, vous avez besoin de remplacer `*` soit par `*arguments` ou par `*, argument=valeur`.

source: This is a message that was added in Python 3.9 to prevent redefining `__peg_parser__`. It should not be present in other versions.
fr: Ceci est un message qui a été ajouté dans la version 3.9 de Python pour éviter de redéfinir `__peg_parser__`. Il ne devrait pas être présent dans les autres versions.

source: The available features are `{names}`.
fr: Les valeurs disponibles sont `{names}`.

source: When using a `from __future__ import` statement, you must import specific named features.
fr: Lors de l’utilisation d’un énoncé `from __future__ import`, vous devez importer des noms spécifiques.

source: Instead of `{feature}`, perhaps you meant to import `{name}`.
fr: Au lieu de `{feature}`, peut-être que vous vouliez plutôt importer `{name}`.

source: `{feature}` is not a valid feature of module `__future__`.
fr: `{feature}` n’est pas un attribut valide du module `__future__`.

source: A `from __future__ import` statement changes the way Python interprets the code in a file. It must appear at the beginning of the file.
fr: Une instruction `from __future__ import` change la façon dont Python interprète le code dans un fichier. Une telle instruction doit apparaître au début du fichier.

source: I suspect you wrote `from __future__ import braces` following someone else's suggestion. This will never work. Unlike other programming languages, Python's code block are defined by their indentation level, and not by using some curly braces, like `{...}`.
fr: Je soupçonne que vous avez écrit `from __future__ import braces` suivant une suggestion de quelqu’un d’autre. Ça ne marchera jamais. Contrairement à d’autres langages de programmation, les blocs de code Python sont définis par leur niveau d’indentation, et non pas en utilisant des accolades, comme `{...}`.

source: You started writing a triple-quoted string but never wrote the triple quotes needed to end the string.
fr: Vous avez commencé à écrire une chaîne débutant avec des triples guillemets, sans inclure les triples guillemets nécessaires pour mettre fin à la chaîne.

source: Did you mean `{num}`?
fr: Vouliez-vous dire `{num}` ?

source: Perhaps you meant to write the octal number `{num}` and forgot the letter 'o', or perhaps you meant to write a decimal integer and did not know that it could not start with zeros.
fr: Peut-être que vous vouliez écrire le nombre octal `{num}` et oublié la lettre 'o', ou peut-être vous vouliez écrire un entier décimal et ne saviez pas qu’il ne pouvait pas commencer par des zéros.

source: Perhaps you meant to write the integer `{num}` and did not know that it could not start with zeros.
fr: Peut-être que vous vouliez écrire l'entier décimal `{num}` et ne saviez pas qu’il ne pouvait pas commencer par des zéros.

source: I am guessing that you were writing a comprehension or a generator expression and forgot to include parentheses around tuples. As an example, instead of writing [i, i**2 for i in range(10)] you would need to write [(i, i**2) for i in range(10)]
fr: Je suppose que vous écriviez une compréhension ou une expression génératrice et vous avez oublié d’inclure des parenthèses autour des tuples. Voici un exemple: au lieu d’écrire [i, i**2 for i in range(10)] vous auriez besoin d’écrire [(i, i**2) for i in range(10)]

source: I am guessing that you wanted to use an `except` statement with multiple exception types. If that is the case, you must surround them with parentheses.
fr: Je suppose que vous vouliez utiliser un énoncé `except` avec plusieurs types d’exception. Si c’est le cas, vous devez les entourer de parenthèses.

source: https://docs.python.org/3/tutorial/errors.html#handling-exceptions
fr: https://docs.python.org/fr/3/tutorial/errors.html#handling-exceptions

source: Did you forget a colon?
fr: Avez-vous oublié d’ajouter les deux points `:` ?

source: Python expected a colon at the position indicated.
fr: Python s’attendait à voir deux points, `:`, à la position indiquée.

source: Python tells us that the {bracket} was never closed.
fr: Python nous dit que le symbole {bracket} n’a jamais été fermé.

source: The {bracket} was never closed.
fr: Le symbole {bracket} n’a jamais été fermé.

source: The double star operator `**` is likely interpreted to mean that dict unpacking is to be used which is not allowed or does not make sense here.
fr: L’opérateur double astérisque, `**` est probablement interprété comme signifiant qu'un déballage de `dict` doit être utilisé ce qui n'est soit par permis ou n’a pas de sens ici.

source: However, making such a change would still not correct all the syntax problems in the code you wrote.
fr: Toutefois, un tel changement ne corrigerait pas tous les problèmes de syntaxe dans le code que vous avez écrit.

source: The closing {bracket} on line {close_lineno} does not match the opening {open_bracket} on line {open_lineno}.
fr: Le symbole {bracket} à la ligne {close_lineno} ne correspond pas au symbole {open_bracket} à la ligne {open_lineno}.

source: It looks like you copy-pasted code from an interactive interpreter. The Python prompt, `>>>`, should not be included in your code.
fr: On dirait que vous avez copié-collé le code d’un interprète interactif. L’invite Python, `>>>`, ne doit pas être incluse dans votre code.

source: You should not use the backquote character.
fr: Vous ne devez pas utiliser le caractère accent grave.

source: You are using the backquote character. Either you meant to write a single quote, ', or copied Python 2 code; in this latter case, use the function `repr(x)`.
fr: Vous utilisez le charactère d'accent grave. Soit que vous vouliez utiliser un apostrophe, ', ou que vous avez copié du code de Python 2; dans ce dernier cas, utilisez la fonction `repr(x)`.

source: You forgot to add a condition.
fr: Vous avez oublié d’ajouter une condition.

source: An `if` statement requires a condition: if condition: ...
fr: Un énoncé `if` doit inclure une condition : if condition: ...

source: A `while` loop requires a condition: while condition: ...
fr: Une boucle `while` doit inclure une condition : while condition: ...

source: A `for` loop requires at least 3 more terms.
fr: Une boucle `for` doit avoir plus de termes.

source: A `for` loop is an iteration over a sequence: for element in sequence: ...
fr: Une boucle `for` est une itération sur une séquence : for élément in séquence: ...

source: A class needs a name.
fr: Une classe a besoin d’un nom.

source: A `class` statement requires a name: class SomeName: ...
fr: Un énoncé `class` doit inclure un nom : class NomQuelconque: ...

source: You cannot use the Python keyword `{word}` as an attribute.
fr: Vous avez tenté d'utiliser le mot clé Python `{word}` comme attribut. Ceci n’est pas permis.

source: You cannot use the constant `__debug__` as an attribute.
fr: Vous ne pouvez pas utiliser la constante `__debug__` comme attribut.

source: `{word}` cannot be used as an attribute.
fr: `{word}` ne peut pas être utilisé comme n attribut.

source: Perhaps you meant to write `elif`.
fr: Peut-être que vous vouliez plutôt `elif`.

source: You likely meant to use Python's `elif` keyword but wrote `{name}` instead.
fr: Vous avez écrit `{name}` au lieu d'utiliser le mot-clé `elif`.

source: Did you mean `from {module} import {function}`?
fr: Vouliez-vous dire `from {module} import {function}` ?

source: You wrote something like import {function} from {module} instead of from {module} import {function}
fr: Vous avez écrit quelque chose comme import {function} from {module} au lieu de from {module} import {function}

source: Perhaps you misplaced a quote.
fr: Vous avez peut-être un guillemet écrit au mauvais endroit.

source: There appears to be a Python identifier (variable name) immediately following a string. I suspect that you were trying to use a quote inside a string that was enclosed in quotes of the same kind.
fr: Il semble y avoir un identificateur Python (nom de variable) immédiatement après une chaîne. Je soupçonne que vous essayiez d'utiliser un apostrophe ou un guillemet à l'intérieur d'une chaîne qui était délimitée par ces mêmes caractères.

source: The augmented assignment operator is not allowed in Python version {version}.
fr: L’opérateur d’affectation augmenté n’existe pas dans la version {version} de Python.

source: You appear to be using the operator `:=`, sometimes called the walrus operator. This operator requires the use of Python 3.8 or newer. You are using version {version}.
fr: Vous semblez utiliser l'opérateur `:=`, parfois appelé l'opérateur morse (walrus operator, en anglais). Cet opérateur nécessite l'utilisation de Python 3.8 ou une version plus récente. Vous utilisez la version {version}.

source: You wrote three equal signs in a row which is allowed in some programming languages, but not in Python. To check if two objects are equal, use two equal signs, `==`; to see if two names represent the exact same object, use the operator `is`.
fr: Vous avez écrit trois signes égaux de suite ce qui est utilisé dans certains langages de programmation, mais pas en Python. Pour vérifier si deux objets sont égaux, utilisent deux signes d'égalité, `==`; pour voir si deux noms représentent exactement le même objet, utilisez l’opérateur `is`.

source: Did you mean to use `is` instead of `===`?
fr: Voulez-vous utiliser `is` au lieu de `===`?

source: You cannot have write the same operator, `{op}`, twice in a row. Perhaps you wrote one of them by mistake or forgot to write something between them.
fr: Vous ne pouvez pas écrire le même opérateur, `{op}`, deux fois de suite. Peut-être avez-vous écrit l’un d’eux par erreur ou vous avez oublié d’écrire quelque chose entre les deux.

source: You cannot have these two operators, `{first}` and `{second}`, following each other. Perhaps you wrote one of them by mistake or forgot to write something between them.
fr: Vous ne pouvez pas avoir ces deux opérateurs, `{first}` et `{second}`, qui se suivent. Peut-être avez-vous écrit l’un d’eux par erreur ou vous avez oublié d’écrire quelque chose entre les deux.

source: Did you leave some spaces between operators?
fr: Avez-vous laissé quelques espaces entre des opérateurs ?

source: It looks like you wrote two operators, `{first}` and `{second}`, separated by spaces instead of writing them as a single operator: `{correct}`
fr: On dirait que vous avez écrit deux opérateurs, `{first}` et `{second}`, séparés par des espaces au lieu de les écrire en tant qu’opérateur unique : `{correct}`

source: Did you write operators in an incorrect order?
fr: Avez-vous écrit des opérateurs dans un mauvais ordre ?

source: It looks like you wrote two operators (`{first}` and `{second}`) in the wrong order: `{wrong}` instead of `{correct}`.
fr: On dirait que vous avez écrit deux opérateurs (`{first}` et `{second}`) dans le mauvais ordre: `{wrong}` au lieu de `{correct}`.

source: Did you mean to use `=`?
fr: Voulez-vous utiliser `=` ?

source: You use the augmented assignment operator `:=` where the normal assignment operator `=` was required.
fr: Vous utilisez l’opérateur d’affectation augmentée `:=` là où l’opérateur d’affectation normal `=` était requis.

source: Perhaps you needed `==` instead of `=`.
fr: Peut-être que vous aviez besoin de `==` au lieu de `=`.

source: You likely used an assignment operator `=` instead of an equality operator `==`.
fr: Vous avez utilisé un opérateur d’affectation `=` au lieu d’un opérateur d'égalité `==`

source: Perhaps you needed `:=` instead of `=:`.
fr: Peut-être que vous aviez besoin d'écrire `==` au lieu de `=`.

source: You used an assignment operator `=` followed by `:`; perhaps you meant to use the walrus operator `:=`.
fr: Vous avez utilisé un opérateur d’affectation `=`; vous vouliez peut-être utiliser un opérateur l'opérateur `:=`.

source: Perhaps you needed `==` or `:=` instead of `=`.
fr: Peut-être que vous aviez besoin de `==` ou `:=` au lieu de `=`.

source: You used an assignment operator `=`; perhaps you meant to use an equality operator, `==`, or the walrus operator `:=`.
fr: Vous avez utilisé un opérateur d’affectation `=`; vous vouliez peut-être utiliser un opérateur d'égalité, `==`, ou l'opérateur `:=`.
