Repository: aroberge/friendly
Catalog: friendly/locales/*/LC_MESSAGES/friendly.po
Languages: fr

source: In older version of Python, `print` was a keyword. Now, `print` is a function; you need to use parentheses to call it.
fr: Dans l'ancienne version de Python, `print` était un mot clé. Maintenant, `print` est une fonction; vous devez utiliser des parenthèses pour l'invoquer.

source: Did you mean `{new_line}`?
fr: Vouliez-vous dire `{new_line}` ?

source: It looks as if you are attempting to use pip to install a module. `pip` is a command that needs to run in a terminal, not from a Python interpreter.
fr: Il semble que vous essayez d’utiliser pip pour installer un module. `pip` est une commande qui doit être invoquée dans un terminal, pas dans un interprète Python.

source: Pip cannot be used in a Python interpreter.
fr: Pip ne peut pas être utilisé dans un interprète Python.

source: I am guessing that you are attempting to use Python to run a program. You must do so from a terminal and not from a Python interpreter.
fr: Je suppose que vous essayez d’utiliser Python pour exécuter un programme. Vous devez le faire à partir d’un terminal et non d’un interprète Python.

source: You cannot have a dot `.` followed by `{bracket}`.
fr: Vous ne pouvez pas avoir un point `.` suivi de `{bracket}`.

source: Perhaps you need to replace the dot by a comma.
fr: Peut-être que vous devez remplacer le point par une virgule.

source: It looks like you are trying to raise an exception using Python 2 syntax.
fr: Je crois que vous essayez de lever une exception en utilisant la syntaxe de Python 2.

source: Did you forget a colon `:`?
fr: Avez-vous oublié d’ajouter les deux points `:` ?

source: You wrote a `{for_while}` loop but forgot to add a colon `:` at the end
fr: Vous vouliez débuter une boucle `{for_while}` mais vous avez oublié d’ajouter deux points `:` à la fin.

source: You wrote a statement beginning with `{name}` but forgot to add a colon `:` at the end.
fr: Vous avez écrit un énoncé débutant avec `{name}` mais vous avez oublié d’ajouter deux points `:` à la fin.

source: You wrote a semi-colon, `;`, where a colon, `:`, was expected.
fr: Vous avez écrit un point-virgule, `;`, au lieu des deux points `:`.

source: Did you mean to write a colon `:`?
fr: Avez-vous oublié d’ajouter les deux points `:` ?

source: You wrote a semi-colon, `;`, where a comma was expected.
fr: Vous avez écrit un point-virgule, `;`, au lieu d'une virgule.

source: Did you made a mistake in writing an hexadecimal integer?
fr: Avez-vous fait une erreur en écrivant un entier hexadécimal ?

source: It looks like you used an invalid character (`{character}`) in an hexadecimal number. Hexadecimal numbers are base 16 integers that use the symbols `0` to `9` to represent values 0 to 9, and the letters `a` to `f` (or `A` to `F`) to represent values 10 to 15. In Python, hexadecimal numbers start with either `0x` or `0X`, followed by the characters used to represent the value of that integer.
fr: On dirait que vous avez utilisé un caractère invalide ('{character}') dans un nombre hexadecimal. Les nombres hexadécimaux sont des entiers en base 16 qui utilisent les symboles `0` à `9` pour représenter les valeurs 0 à 9, et les lettres `a` à `f` (ou `A` à `F`) pour représenter les valeurs 10 à 15. Dans Python, les nombres hexadécimaux commencent par `0x` ou `0X`, suivi des caractères utilisés pour représenter la valeur du nombre.

source: Did you made a mistake in writing an octal integer?
fr: Avez-vous fait une erreur en écrivant un entier octal ?

source: It looks like you used an invalid character (`{character}`) in an octal number. Octal numbers are base 8 integers that only use the symbols `0` to `7` to represent values. In Python, hexadecimal numbers start with either `0o` or `0O`, (the digit zero followed by the letter `o`) followed by the characters used to represent the value of that integer.
fr: On dirait que vous avez utilisé un caractère invalide ('{character}') dans un nombre octal. Les nombres octaux sont des entiers de base 8 qui n’utilisent que les symboles `0` à `7` pour représenter les valeurs. Dans Python, les nombres octaux commencent par `0o` ou `0O`, (le chiffre zéro suivi de la lettre `o`) suivi des caractères utilisés pour représenter la valeur de cet entier.

source: Valid names cannot begin with a number.
fr: Les noms valides ne peuvent pas commencer par un chiffre.

source: Did you mean `{number}j`?
fr: Vouliez-vous dire `{number}j` ?

source: Perhaps you thought that `i` could be used to represent the square root of `-1`. In Python, the symbol used for this is `j` and the complex part is written as `some_number` immediately followed by `j`, with no spaces in between. Perhaps you meant to write `{number}j`.
fr: Peut-être pensiez-vous que `i` pouvait être utilisé pour représenter la racine carrée de `-1`. Dans Python, le symbole utilisé pour ceci est `j` et la partie imaginaire d'un nombre complexe a la forme `nombre` suivie immédiatement par `j` sans aucun espace entre les deux. Peut-être que vous vouliez écrire `{number}j`.

source: [Note: `{first}` is a complex number.]
fr: [N.B.: `{first}` est un nombre complexe.]

source: Perhaps you forgot a multiplication operator, `{first} * {second}`.
fr: Peut-être avez-vous oublié un opérateur de multiplication, `{first} * {second}`.

source: Your Python version does not support this f-string feature.
fr: Votre version Python ne prend pas en charge cette fonctionnalité des f-string.

source: You are likely using a 'debug' syntax of f-strings introduced in Python version 3.8. You are using version {version}.
fr: Vous utilisez probablement une syntaxe de f-strings introduite dans la version 3.8 de Python. Vous utilisez la version {version}.

source: You are likely trying to assign a value within an f-string. This is not allowed.
fr: Vous avez tenté d’assigner une valeur à l'intérieur d'une chaîne "f-string". Ceci n’est pas permis.

source: The content of your f-string is invalid. Please consult the documentation: https://docs.python.org/3/reference/lexical_analysis.html#f-strings
fr: Le contenu de votre chaîne est invalide. Veuillez consulter la documentation : https://docs.python.org/fr/3/reference/lexical_analysis.html#f-strings

source: You tried to define a class and did not use the correct syntax.
fr: Vous vouliez définir une classe, mais vous avez fait des erreurs de syntaxe.

source: Python keywords cannot be used as identifiers (variable names).
fr: Les mots clés Python ne peuvent pas être utilisés comme identifiants (noms de variables).

source: `lambda` does not allow parentheses around its arguments. This was allowed in Python 2 but it not allowed in Python 3.
fr: `lambda` ne permet pas de parenthèses autour de ses arguments. Cela était permis dans Python 2, mais il ne l'est plus dans Python 3.

source: You cannot have explicit tuples as arguments. Assign any tuple to a parameter and unpack it within the body of the function.
fr: Vous ne pouvez pas avoir des tuples explicites comme arguments. Attribuez n’importe quel tuple à un paramètre et dépaquetez-le dans le corps de la fonction.

source: If you remove `{type_decl}`, you will have a valid Python statement.
fr: Si vous supprimez `{type_decl}`, vous aurez une instruction Python valide.

source: However, even if you remove `{type_decl}`, there would still be some some syntax errors.
fr: Toutefois, même si vous supprimez `{type_decl}`, il y aurait encore au moins une autre erreur de syntaxe.

source: You do not need to declare variables in Python.
fr: Vous n’avez pas besoin de déclarer des variables dans Python.

source: It looks like you were trying to declare that `{var}` was a variable using the word `{type_decl}`.
fr: Il semble que vous essayiez de déclarer que `{var}` est une variable utilisant le mot `{type_decl}`.

source: I am guessing that you forgot a comma between two strings when defining a dict.
fr: Je crois que vous avez oublié une virgule entre deux chaînes de caractères lors de la définition d’un dictionnaire.

source: Did you forget to write `in`?
fr: Avez-vous oublié d’écrire `in` ?

source: It looks as though you forgot to use the keyword `in` as part of a `for` statement. Perhaps you meant: {new_statement}
fr: Il semble que vous avez oublié d’utiliser le mot clé `in » dans énoncé `for`. Peut-être que vous vouliez dire: {new_statement}

source: Did you forget to write parenthesis?
fr: Avez-vous oublié d’ajouter des parenthèses ?

source: It looks as though you forgot to use to use parenthesis with `range`. Perhaps you meant: {new_statement}
fr: Il semble que vous avez oublié d’utiliser des parenthèses avec `range`. Peut-être que vous vouliez dire: {new_statement}

source: Perhaps you meant to write `{keyword}` and made a typo. The correct line would then be `{line}`
fr: Peut-être que vous vouliez écrire `{keyword}` et que vous avez fait une faute. Si c'est le cas, la ligne correcte aurait été au lieu de `{line}`.

source: Perhaps you wrote another word instead of a Python keyword. If that is the case, perhaps you meant to write one of the following lines of code which might not raise a `SyntaxError`:
fr: Peut-être avez-vous écrit un autre mot au lieu d’un mot clé Python. Si c’est le cas, peut-être que vous vouliez écrire un des choix suivants de lignes de code qui ne soulèveraient pas une erreur de type `SyntaxError` :

source: You cannot have spaces in identifiers (variable names).
fr: Vous ne pouvez pas avoir d’espaces dans les identifiants (noms de variables).

source: `bf` is an illegal string prefix.
fr: `bf` est un préfixe de chaîne illégal.

source: I am guessing that you wanted a binary f-string; this is not allowed.
fr: Je devine que vous vouliez une chaîne "f-string" binaire; ceci n’est pas permis.

source: It is possible that you forgot a comma between items in a tuple, or between function arguments, before the position indicated by ^.
fr: Il est également possible que vous ayez oublié une virgule entre les éléments d'un tuple, ou entre les arguments d'une fonction, avant la position indiquée par ^.

source: It is possible that you forgot a comma between items in a list before the position indicated by ^.
fr: Il est également possible que vous ayez oublié une virgule entre les éléments d'une liste avant la position indiquée par ^.

source: It is possible that you forgot a comma between items in a set or dict before the position indicated by ^.
fr: Il est également possible que vous ayez oublié une virgule entre les éléments d'un ensemble (set) ou un dict avant la position indiquée par ^.

source: Python indicates that the error is caused by `{second}` written immediately after `{first}`.
fr: Python indique que l’erreur est causée par `{second}` écrit tout juste après `{first}`.

source: Perhaps you meant {line}
fr: Peut-être que vous vouliez plutôt {line}

source: Did you forget something between `{first}` and `{second}`?
fr: Avez-vous oublié quelque chose entre `{first}` et `{second}` ?

source: Perhaps you meant to insert an operator like `{operators}` between `{first}` and `{second}`. The following lines of code would not cause any `SyntaxError`:
fr: Peut-être que vous vouliez insérer un opérateur comme `{operators}` entre `{first}` et `{second}`. Les lignes de code suivantes ne causeraient pas des `SyntaxError :

source: Note: these are just some of the possible choices and that some of them might raise other types of exceptions.
fr: Remarque : ce ne sont là que quelques-uns des choix possibles et certains d’entre eux pourraient soulever d’autres types d’exceptions.

source: It is possible that you used an equal sign `=` instead of a colon `:` to assign values to keys in a dict before or at the position indicated by ^.
fr: Il est possible que vous ayez utilisé un signe d'égalité `=` au lieu de deux points `:` pour attribuer des valeurs à une clé d'un dictionnaire avant ou exactement à la position indiquée par ^.

source: The Python keyword `and` can only be used for boolean expressions. Perhaps you meant to write `{new_statement}`
fr: Le mot clé Python `and` ne peut être utilisé que pour les expressions booléennes. Peut-être que vous vouliez écrire `{new_statement}`

source: I am guessing that you are trying to import at least one object from module `{module}` and rename it using the Python keyword `as`; this keyword can only be used to rename one object at a time using a well defined syntax. I suggest that you split up any such import statement with each object renamed on a separate line as follows: from {module} import object_1 as name_1 from {module} import object_2 as name_2 # if needed
fr: Je suppose que vous essayez d’importer au moins un objet à partir du module `{module}` pour le renommer en utilisant le mot clé Python `as`; ce mot clé ne peut être utilisé que pour renommer un objet à la fois en utilisant une syntaxe bien définie. Je vous suggère de diviser une telle déclaration d’importation avec chaque objet renommé sur une ligne séparée comme suit: from {module} import objet_1 as nom_1 from {module} import objet_2 as nom_2 # si nécessaire

source: I am guessing that you were writing a comprehension or a generator expression and use the wrong order for a condition. The correct order depends if there is an `else` clause or not. For example, the correct order for a list comprehensions with condition can be either [f(x) if condition else other for x in sequence] # 'if' before 'for' or, if there is no `else` [f(x) for x in sequence if condition] # 'if' after 'for'
fr: Je suppose que vous écriviez une compréhension ou une expression génératrice et avez utiliser le mauvais ordre pour une condition. L'ordre correct dépend de la présence ou non d'une clause `else`. Par exemple, le bon ordre pour une compréhension de liste avec une condition est [f(x) if condition else autre for x in séquence] # 'if' avant 'for' ou, s'il n'y a pas de `else` [f(x) pour x in séquence si condition] # 'if' après 'for'

source: The opening {bracket} on line {linenumber} is not closed.
fr: Le symbole {bracket} à la ligne {linenumber} n'est pas fermé par le symbole correspondant.

source: parenthesis `(`
fr: parenthèse `(`

source: parenthesis `)`
fr: parenthèse `)`

source: square bracket `[`
fr: crochet `[`

source: square bracket `]`
fr: crochet `]`

source: curly bracket `{`
fr: accolade `{`

source: curly bracket `}`
fr: accolade `}`
