Repository: aroberge/friendly
Catalog: friendly/locales/*/LC_MESSAGES/friendly.po
Languages: fr

source: Python indicated that you have a circular import. This can occur if executing the code in module 'A' results in executing the code in module 'B' where an attempt to import a name from module 'A' is made before the execution of the code in module 'A' had been completed.
fr: Python a indiqué que vous avez une importation circulaire. Cela peut se produire si l’exécution du code dans le module 'A' entraîne l’exécution du code dans le module 'B' où une tentative d’importer un nom du module 'A' est faite avant que l’exécution du code dans le module ' A' ne soit terminée.

source: Inconsistent state: `'{module}'` was apparently not imported. As a result, no further analysis can be done.
fr: État incohérent : `{module}` n’a apparemment pas été importé. Par conséquent, aucune autre analyse ne peut être effectuée.

source: Perhaps you meant to import `{correct}` (from `{module}`) instead of `{typo}`
fr: Peut-être que vous vouliez importer `{correct}` (de `{module}`) au lieu de `{typo}`.

source: Instead of trying to import `{typo}` from `{module}`, perhaps you meant to import one of the following names which are found in module `{module}`: `{candidates}`
fr: Au lieu d’essayer d’importer des `{typo}` de `{module}`, peut-être que vous vouliez importer l’un des les noms suivants qui se trouvent dans le module `{module}`: `{candidates}`

source: The object that could not be imported is `{name}`.
fr: L’objet qui n’a pas pu être importé est `{name} `.

source: The problem was likely caused by what is known as a 'circular import'. First, Python imported and started executing the code in file '{file}'. which imports module `{last_module}`. During this process, the code in another file, '{last_file}' was executed. However in this last file, an attempt was made to import the original module `{last_module}` a second time, before Python had completed the first import.
fr: Le problème a probablement été causé par ce qu’on appelle une « importation circulaire ». Tout d’abord, Python a importé et a commencé à exécuter le code dans le fichier '{file}'. qui importe le module `{last_module}`. Au cours de ce processus, le code d’un autre fichier, '{last_file}' a été exécuté. Toutefois, dans ce dernier dossier, une tentative a été pour importer le module d’origine `{last_module}` une deuxième fois, avant que Python n’ait terminé la première importation.

source: You have tried to get the item with index `{index}` of `{name}`, {obj_type} of length `{length}`.
fr: Vous avez essayé d’obtenir l’élément avec l’index `{index}` de `{name}`, {obj_type} de longueur `{length}`.

source: You have tried to get an item from `{name}`, {obj_type} of length `{length}`, by using a value for the index that I cannot determine but which is not allowed.
fr: Vous avez essayé d’obtenir un élément de `{name}`, {obj_type} de longueur `{length}`, en utilisant une valeur pour l’indice que je ne peux pas déterminer, mais qui n’est pas valide.

source: The largest valid index of `{name}` is `{index}`.
fr: Le plus grand indice valide de `{name}` est `{index}`.

source: Remember: the first item of {obj_type} is at index 0.
fr: N’oubliez pas : le premier élément d'un objet de type `{obj_type}` est à l’indice 0.

source: In your program, the key that cannot be found is `{key}`.
fr: Dans votre programme, la clé inconnue est `{key}`.

source: `{key}` is a string. There is a key of `{name}` whose string representation is identical to `{key}`.
fr: `{key}` est une chaîne de caractères. Il y a une clé de `{name}` dont la représentation en une chaîne est identique à `{key}`.

source: Did you convert '{key}' into a string by mistake?
fr: Avez-vous converti `{key}` en une chaîne par erreur ?

source: `{name}` is a key of `{dict_}` which is similar to `{key}`.
fr: `{name}` est une clé de `{dict_}` qui est similaire à `{key}`.

source: `{dict_}` has some keys similar to `{key}` including: `{names}`
fr: `{dict_}` a quelques clés semblables à `{key}`, y compris: `{names}`

source: `{name}` contains a string key which is identical to `str({key})`. Perhaps you forgot to convert the key into a string.
fr: `{name}` contient une clé identique à `str({key})`. Peut-être avez-vous oublié de convertir la clé en une chaîne.

source: Did you forget to convert '{key}' into a string?
fr: Avez-vous oublié de convertir `{key}` en une chaîne ?

source: The curses module is rarely installed with Python on Windows.
fr: Le module curses est rarement installé avec Python sur Windows.

source: The curses module is often not installed with Python.
fr: Le module curses est rarement installé avec Python sur Windows.

source: You have tried to import the curses module.
fr: Vous avez essayé d’importer le module curses.

source: The name of the module that could not be imported is `{name}`.
fr: Le nom du module qui n’a pas pu être importé est `{name}`.

source: The following existing modules have names that are similar to the module you tried to import: `{names}`
fr: Les modules existants suivants ont des noms similaires au module que vous avez essayé d’importer : `{names}`

source: `{name}` is an existing module that has a similar name.
fr: `{name}` est un module existant qui a un nom similaire.

source: No additional information available since `{name}` cannot be imported.
fr: Aucune information supplémentaire n’est disponible puisque `{name}` ne peut pas être importé.

source: Did you mean `from {name} import {rest}`?
fr: Vouliez-vous dire `from {name} import {rest}` ?

source: `{rest}` is not a separate module but an object that is part of `{name}`.
fr: `{rest}` n’est pas un module distinct, mais un objet qui fait partie de `{name}`.

source: Did you mean `import {name}.{attr}`?
fr: Vouliez-vous dire `import {name}.{attr}` ?

source: Perhaps you meant `import {name}.{attr}`. `{attr}` is a name similar to `{rest}` and is a module that can be imported from `{name}`.
fr: Peut-être que vous vouliez dire `import {name}.{attr}`. `{attr}` est un nom semblable à `{rest}` et est un module qui peut être importé de `{name}`.

source: Did you mean `from {name} import {attr}`?
fr: Vouliez-vous dire `from {name} import {attr}` ?

source: Perhaps you meant `from {name} import {attr}`. `{attr}` is a name similar to `{rest}` and is an object that can be imported from `{name}`.
fr: Peut-être vouliez-vous dire `from {name} import {attr}`. `{attr}` est un nom similaire à `{rest}` et est un objet qui peut être importé de `{name}`.

source: Other objects with similar names that are part of `{name}` include `{others}`.
fr: D’autres objets avec des noms similaires qui font partie de `{name}` comprennent `{others}`.

source: `{rest}` cannot be imported from `{name}`.
fr: `{rest}` ne peut pas être importé de `{name}`.

source: In your program, `{var_name}` is an unknown name that had been declared as belonging in a nonlocal scope; however, no such name could not be found.
fr: Dans votre programme,`{var_name}` est un nom inconnu qui avaient été déclaré comme appartenant à une portée non locale; cependant, aucun objet avec ce nom n’a pu être trouvé.

source: In your program, `{var_name}` is an unknown name.
fr: Dans votre programme, `{var_name}` est un nom inconnu.

source: Did you mean `1j`?
fr: Vouliez-vous dire `1j` ?

source: However, sometimes `{name}` is intended to represent the square root of `-1` which is written as `1j` in Python.
fr: Toutefois, parfois, `{name}` est utilisé pour représenter la racine carrée de `-1` qui est écrit `1j` en Python.

source: Did you use a colon instead of an equal sign?
fr: Avez-vous utilisé deux points au lieu d’un signe égal ?

source: I have no additional information for you.
fr: Je n’ai pas d’informations supplémentaires pour vous.

source: The similar name `{name}` was found in the local scope.
fr: Le nom semblable `{name}` a été trouvé dans la portée locale.

source: The similar name `{name}` was found in the global scope.
fr: Le nom semblable `{name}` a été trouvé dans la portée globale.

source: The Python builtin `{name}` has a similar name.
fr: L'identifiant Python (builtin) `{name}` a un nom semblable.

source: Instead of writing `{name}`, perhaps you meant one of the following:
fr: Au lieu d’écrire `{name}`, peut-être que vous vouliez écrire l'un des noms suivants :

source: * Local scope:
fr: * Portée locale :

source: * Global scope:
fr: * Portée globale :

source: * Python builtins:
fr: * Identifiant Python (builtins) :

source: Did you forget to add `self`?
fr: Avez-vous oublié d’ajouter `self` ?

source: The {scope} object `{obj}` has an attribute named `{unknown_name}`. Perhaps you should have written `self.{unknown_name}` instead of `{unknown_name}`.
fr: L’objet {scope} `{obj}` a un attribut nommé `{unknown_name}`. Peut-être que vous auriez dû écrire `moi-même.{unknown_name}` au lieu de `{unknown_name}`.

source: Did you forget to convert the string `{name}` into {number_type}?
fr: Avez-vous oublié de convertir `{name}` en {number_type} ?

source: Perhaps you forgot to convert the string `{name}` into {number_type}.
fr: Peut-être avez-vous oublié de convertir `{name}` en {number_type}.

source: You tried to concatenate (add) two different types of objects: {first} and {second}.
fr: Vous avez essayé de concaténer (additionner) deux types d’objets différents: {first} et {second}.

source: You tried to add two incompatible types of objects: {first} and {second}.
fr: Vous avez essayé d’additionner deux types d’objets incompatibles: {first} et {second}.

source: You tried to subtract two incompatible types of objects: {first} and {second}.
fr: Vous avez tenté de soustraire deux types d’objets incompatibles: {first} et {second}.

source: You tried to multiply two incompatible types of objects: {first} and {second}.
fr: Vous avez essayé de multiplier deux types d’objets différents: {first} et {second}.

source: You tried to divide two incompatible types of objects: {first} and {second}.
fr: Vous avez essayé de diviser deux types d’objets différents: {first} et {second}.

source: You tried to perform the bitwise operation {operator} on two incompatible types of objects: {first} and {second}.
fr: Vous avez essayé d’effectuer l’opération binaire bit à bit {operator} sur deux types d’objets incompatibles: {first} et {second}.

source: Did you mean `{line}`?
fr: Vouliez-vous dire `{line}` ?

source: Outside of Python, `^` is often used to indicate exponentiation.
fr: Ailleurs que dans Python, `^` est souvent utilisé pour indiquer l’exponentiation.

source: Perhaps you meant `{line}`.
fr: Peut-être que vous vouliez plutôt `{line}`.

source: You tried to perform the bit shifting operation {operator} on two incompatible types of objects: {first} and {second}.
fr: Vous avez essayé d’effectuer l’opération de décalage {operator} sur deux types d’objets incompatibles: {first} et {second}.

source: You tried to exponentiate (raise to a power) using two incompatible types of objects: {first} and {second}.
fr: Vous avez essayé d'élever à une puissance en utilisant deux types d’objets incompatibles: {first} et {second}.

source: You tried to use the operator {operator} using two incompatible types of objects: {first} and {second}. This operator is normally used only for multiplication of matrices.
fr: Vous avez essayé d’utiliser l’opérateur {operator} à l’aide de deux types d’objets incompatibles: {first} et {second}. Cet opérateur est normalement utilisé uniquement pour la multiplication des matrices.

source: Complex numbers cannot be ordered.
fr: Les nombres complexes ne peuvent pas être ordonnés du plus petit au plus grand.

source: You tried to do an order comparison ({operator}) between two complex numbers.
fr: Vous avez essayé de faire une comparaison d'ordre ({operator}) entre deux nombres complexes.

source: You tried to do an order comparison ({operator}) between two incompatible types of objects: {first} and {second}.
fr: En utilisant {operator}, vous avez tenté de comparer deux types d’objets incompatibles: {first} et {second}.

source: Perhaps you meant to write `{operator}=` instead of `={operator}`
fr: Peut-être que vous vouliez plutôt écrire `{operator}=` au lieu de `={operator}`

source: You tried to use the unary operator '{operator}' with the following type of object: {obj}. This operation is not defined for this type of object.
fr: Vous avez essayé d’utiliser l’opérateur unaire '{operator}' avec le type d’objet suivant: {obj}. Cette opération n’est pas définie pour ce type d’objet.

source: In Python, some objects are known as immutable: once defined, their value cannot be changed. You tried change part of such an immutable object: {obj}, most likely by using an indexing operation.
fr: Dans Python, certains objets sont connus comme immuables: une fois définis, leur valeur ne peut pas être modifiée. Vous avez essayé de modifier une partie d’un tel objet immuable: {obj}, probablement en utilisant une opération d’indexation.

source: Did you mean to use a list?
fr: Voulez-vous utiliser une liste?

source: Perhaps you meant to use a list instead.
fr: Peut-être que vous vouliez plutôt utiliser une liste.

source: In Python 3, exceptions must be derived from BaseException.
fr: Dans Python 3, les exceptions doivent être dérivées de BaseException.

source: You apparently have called the function `{fn_name}` with {nb_given} positional argument(s) while it requires {nb_required} such positional argument(s).
fr: Vous avez apparemment invoqué la fonction `{fn_name}` avec {nb_given} arguments positionnels alors qu'elle en requiert {nb_required}.

source: Perhaps you forgot `self` when defining `{fn_name}`.
fr: Peut-être avez-vous oublié `self` lors de la définition de `{fn_name}`.

source: You apparently have called the function '{fn_name}' with fewer positional arguments than it requires ({nb_required} missing).
fr: Vous avez apparemment invoqué la fonction '{fn_name}' avec moins d'arguments positionnels qu'il n'en faut ({nb_required} manquent).

source: Note: `NoneType` means that the object has a value of `None`.
fr: Remarque : `NoneType` signifie que l’objet a une valeur de `None`.

source: Python indicates that you have an object of type `{obj_type}`, followed by something surrounded by parentheses, `(...)`, which Python took as an indication of a function call. Either the object of type `{obj_type}` was meant to be a function, or you forgot a comma before `(...)`.
fr: Python indique que vous avez un objet de type `{obj_type}`, suivi de quelque chose entouré de parenthèses, `(...)`, que Python a pris comme une indication d’une invocation de fonction. Soit que l’objet du type `{obj_type}` était censé être une fonction, ou soit que vous avez oublié une virgule avant `(...)`.

source: The parenthesis `()` following `{obj_name}` are interpreted by Python as a function call for `{obj_name}`. However, `{obj_name}` is not a function but an object of type `{obj_type}`.
fr: En raison des parenthèses, `{obj_name}` est interprété par Python comme indiquant une invocation de fonction pour `{obj_name}`. Celui-ci n'est pas une fonction mais plutôt un objet de type `{obj_type}` ne pouvant pas être invoqué.

source: Because of the surrounding parenthesis, `{fn_call}` is interpreted by Python as indicating a function call for `{obj_name}`, which is an object of type `{obj_type}` which cannot be called.
fr: En raison des parenthees, `{fn_call}` est interprété par Python comme indiquant une invocation de fonction pour `{obj_name}`, qui est un objet de type `{obj_type}` ne pouvant pas être invoqué.

source: However, `{fn_call}` is a `tuple`. Either the object `{obj_name}` was meant to be a function or you have a missing comma between the object `{obj_name}` and the tuple `{fn_call}` and meant to write `{obj_name}, {fn_call}`.
fr: Cependant, `{fn_call}` est un `tuple`. Soit que l’objet `{obj_name}` devait être une fonction ou soit que vous avez une virgule manquante entre l’objet `{obj_name}` et le tuple `{fn_call}` et auriez dû écrire `{obj_name}, {fn_call}`.

source: Did you forget a comma between `{obj_name}` and `{fn_call}`?
fr: Avez-vous oublié une virgule entre `{obj_name}` et `{fn_call}` ?

source: However, `{obj_name}` is a sequence. Perhaps you meant to use `[]` instead of `()` and write `{obj_name}[{slice}]`
fr: Cependant, `{obj_name}` est une séquence. Peut-être que vous vouliez utiliser `[]` au lieu de `()` et écrire `{obj_name}[{slice}]`

source: Did you mean `{obj_name}[{slice}]`?
fr: Vouliez-vous dire `{obj_name}[{slice}]` ?

source: However, both `{obj_name}` and `{fn_call}` are numbers. Perhaps you forgot a multiplication operator, `*`, and meant to write `{obj_name} * {fn_call}` .
fr: Cependant, les `{obj_name}` et « {fn_call} » sont des nombres. Peut-être avez-vous oublié un opérateur de multiplication, `*`, et auriez dû écrire `{obj_name} * {fn_call}` .

source: Did you mean `{obj_name} * {fn_call}`?
fr: Vouliez-vous dire `{obj_name} * {fn_call}` ?

source: Did you forget to convert `{name}` into an integer?
fr: Avez-vous oublié de convertir `{name}` en un entier ?

source: Perhaps you forgot to convert `{name}` into an integer.
fr: Peut-être avez-vous oublié de convertir `{name}` en un entier.

source: You can only multiply sequences, such as list, tuples, strings, etc., by integers.
fr: Vous ne pouvez multiplier les séquences, telles que les listes, les tuples, les chaînes, etc., que par des entiers.

source: Did you forget to convert `{name1}` and `{name2}` into integers?
fr: Avez-vous oublié de convertir `{name1}` et `{name2}` en entiers ?

source: Perhaps you forgot to convert `{name1}` and `{name2}` into integers.
fr: Peut-être avez-vous oublié de convertir `{name1}` et `{name2}` en entiers.

source: You wrote an object whose value is `None` where an integer was expected.
fr: Vous avez écrit un objet dont la valeur est `None` là où un entier était attendu.

source: You wrote an object of type `{obj}` where an integer was expected.
fr: Vous avez écrit un objet de type `{obj}` là où un entier était attendu.

source: Did you forget to convert `{names}` into integers?
fr: Avez-vous oublié de convertir `{names}` en entiers ?

source: Perhaps you forgot to convert `{names}` into integers.
fr: Peut-être avez-vous oublié de convertir `{names}` en entiers.

source: In the expression `{line}` what is included between the square brackets, `[...]`, must be either an integer or a slice (`start:stop` or `start:stop:step`) and you have used {obj_type} instead.
fr: Dans l’expression `{line}` ce qui est inclus entre les crochets, `[...]`, doit être soit un entier ou une tranche (`start:stop` ou `start:stop:step`) et vous l’avez utilisé {obj_type} la place.

source: Note: sometimes this exception is raised because what Python interprets as indices was meant to be a separate list, and a comma should have been written before the opening `[` of that list.
fr: Remarque : parfois, cette exception est soulevée parce que ce que Python interprète comme des indices était censé être une liste distincte, et une virgule aurait dû être écrit avant le crochet `[` débutant cette liste.

source: Did you forget a comma?
fr: Avez-vous oublié une virgule ?

source: Perhaps you have forgotten a comma between two identical lists `{container}`. The second list had been interpreted as the indexation the first one by the index `{new_index}`
fr: Peut-être avez-vous oublié une virgule entre deux listes identiques `{container}`. La deuxième liste avait été interprétée comme l’indexation la première par l’indice `{new_index}`

source: Perhaps you have forgotten a comma between the object `{container}` and the list `{index}`. The list `{index}` had been interpreted as the indexation of object `{container}` by the index `{new_index}`
fr: Peut-être avez-vous oublié une virgule entre l’objet `{container}` et la liste `{index}`. La liste `{index}` avait été interprétée comme l’indexation de l’objet `{container}` par l’indice `{new_index}`

source: Did you forget a comma before `{index}`?
fr: Avez-vous oublié une virgule avant `{index}` ?

source: When using a slice to extract a range of elements from a sequence, that is something like `[start:stop]` or `[start:stop:step]` each of `start`, `stop`, `step` must be either an integer, `None`, or possibly some other object having an `__index__` method.
fr: Lors de l’utilisation d’une tranche pour extraire une gamme d’éléments d’une séquence, c’est-à-dire quelque chose comme `[start:stop]` ou `[start:stop:step]` chacune des variables `start`, `stop`, et `step` doit être soit un entier, soit `None`, ou possiblement un autre objet ayant une méthode `__index__`.

source: Only hashable objects can be used as elements of `set` or keys of `dict`. Hashable objects are objects that do not change value once they have been created.
fr: Seuls les objets hachables peuvent être utilisés comme éléments de `set` ou des clés de `dict`. Les objets hachables sont des objets qui ne changent pas de valeur une fois qu’ils ont été créés.

source: Instead of using {original}, consider using {replacement}.
fr: Au lieu d’utiliser {original}, envisagez d’utiliser {replacement}.

source: Subscriptable objects are typically containers from which you can retrieve item using the notation `[...]`.
fr: Les objets subscriptibles sont généralement des conteneurs à partir desquels on peut tirer des éléments en utilisant la notation `[...]`.

source: Using this notation, you attempted to retrieve an item from an object of type `{obj_type}` which is not allowed.
fr: À l’aide de cette notation, vous avez tenté de tirer un élément d’un objet de type `{obj_type}`, ce qui n’est pas permis.

source: Perhaps you meant to write `{line}`.
fr: Peut-être que vous vouliez plutôt écrire `{line}`.

source: Using this notation, you attempted to retrieve an item from `{name}`, an object of type `{obj_type}`. This is not allowed.
fr: À l’aide de cette notation, vous avez tenté de tirer un élément de `{name}`, un objet de type `{obj_type}`. Ceci n’est pas permis.

source: An iterable is an object capable of returning its members one at a time. Python containers (`list, tuple, dict`, etc.) are iterables. An iterable is required here.
fr: Un itérable est un objet capable de renvoyer ses membres un à la fois. Les contenants python (`list, tuple, dict`, etc.) sont itérables. Une itérable est requis ici.

source: Unpacking is a convenient way to assign a name, to each item of an iterable.
fr: Le dépaquetage ('unpack') est un moyen pratique d’attribuer un nom à chaque élément d’un itérable.

source: An iterable is an object capable of returning its members one at a time. Python containers (`list, tuple, dict`, etc.) are iterables, but not objects of type `{obj_type}`.
fr: Un itérable est un objet capable de renvoyer ses membres un à la fois. Les contenants python (`list, tuple, dict`, etc.) sont itérables, mais pas les objets de type `{obj_type}`.

source: {function} does not accept a sequence as an argument. Instead of writing `{line}` perhaps you should use the `dict.fromkeys()` method: `{new_line}`.
fr: {function} n’accepte pas une séquence comme argument. Au lieu d’écrire `{line}` peut-être devriez-vous utiliser la méthode `dict.fromkeys()` : `{new_line}`.

source: Perhaps you need to use the `dict.fromkeys()` method.
fr: Peut-être que vous vouliez plutôt utiliser la méthode `dict.fromkeys()`.
